cf/Documents/СборочныйЛист.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>СборочныйЛист</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РезервыВЯчейках</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыСобранные</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВЯчейках</xr:Item>
				<xr:Item>AccumulationRegister.СборщикЗаказа</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВРезерве</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВСборке</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Удалить_Заказ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Заказ</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>7</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПозиций</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСборочногоЛиста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСборочныхЛистов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаСобранногоТовара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМест</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСборки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контролер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЖесткаяУпаковка</Name>
					<Comment>Количество в жесткой упаковке</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Заказ</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сборщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ячейка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеНайдено</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Собрать</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Ячейки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ячейка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/CommonModules/ЗаказыКоллекцияСервер/Ext/Module.bsl
// ПОЛУЧЕНИЕ ДАННЫХ

Функция ПолучитьВсеЗаказыЗадач(выбЗадачи) Экспорт
	
	// возвращает все заказы связанные с переданными задачми
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ Заказ Поместить Заказы ИЗ Задача.ЗадачаПользователю ГДЕ Ссылка В (&Задачи);
	|ВЫБРАТЬ РАЗЛИЧНЫЕ 	Заказ
	|ИЗ 				Документ.СборочныйЛист.Товары ГДЕ Ссылка В(
	|						ВЫБРАТЬ Ссылка ИЗ Документ.СборочныйЛист.Товары ГДЕ Заказ В(ВЫБРАТЬ Заказ Из Заказы))
	|ОБЪЕДИНИТЬ
	|ВЫБРАТЬ Заказ ИЗ Заказы
	|");
	
	Запрос.УстановитьПараметр("Задачи", выбЗадачи);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Заказ");
	
КонецФункции
Функция ПолучитьЗадачиБизнесПроцессыСОбщимСборочникомВЗаказах(Заказ, Склад, СборочныйЛист) Экспорт
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ Ссылка Задача, БизнесПроцесс, БизнесПроцесс.СборочныйЛист СборочныйЛист ИЗ Задача.ЗадачаПользователю 
	|ГДЕ 
	|	Выполнена 		= ЛОЖЬ И
	|	Склад 			= &Склад И
	|	ТочкаМаршрута 	= &ТочкаСобратьТовар И
	|	Ссылка.Заказ В(
	|				ВЫБРАТЬ РАЗЛИЧНЫЕ Заказ 
	|				ИЗ Документ.СборочныйЛист.Товары 
	|				ГДЕ Ссылка = &СборочныйЛист И Заказ <> &Заказ)
	|");
	
	Запрос.УстановитьПараметр("СборочныйЛист", 		СборочныйЛист);
	Запрос.УстановитьПараметр("Склад", 				Склад);
	Запрос.УстановитьПараметр("Заказ", 				Заказ);
	Запрос.УстановитьПараметр("ТочкаСобратьТовар", 	БизнесПроцессы.СборкаТовара.ТочкиМаршрута.СобратьТовар);

	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьСписокЗаказовКОбъединению(ЗадачаСсылка, ДопУсловия = Неопределено) Экспорт
	
	// ДопУсловия - структура
	//	- Параметры 			- (массив) параметры запроса
	//	- ТекстФильтраЗароса 	- (строка) текст который подставляется в блок условий запроса
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Заказ, Заказ.Номер Номер, Заказ.Дата Дата, ЕСТЬNULL(Заказ.Контрагент, Заказ.Заказчик) Заказчик, Заказ.Сумма Сумма, ТИПЗНАЧЕНИЯ(Заказ) ТипЗаказа
	|ИЗ
	|	Задача.ЗадачаПользователю
	|ГДЕ
	|	НЕ ПометкаУдаления И НЕ Выполнена И
	|	Склад = &Склад И Пользователь = &Пользователь И Роль = &Роль И
	|	ТочкаМаршрута = &ТочкаМаршрута
	|	// Доп. параметры
	|
	|УПОРЯДОЧИТЬ ПО 
	|	Заказ.Дата
	|");
	
	Запрос.УстановитьПараметр("Склад", 			ЗадачаСсылка.Склад);
	Запрос.УстановитьПараметр("Пользователь", 	ЗадачаСсылка.Пользователь);
	Запрос.УстановитьПараметр("Роль", 			ЗадачаСсылка.Роль);
	Запрос.УстановитьПараметр("ТочкаМаршрута", 	ЗадачаСсылка.ТочкаМаршрута);
	
	Если ДопУсловия <> Неопределено Тогда
		Для Каждого Параметр Из ДопУсловия.Параметры Цикл Запрос.УстановитьПараметр(Параметр.Ключ, Параметр.Значение) КонецЦикла;
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "// Доп. параметры", ДопУсловия.ТекстФильтраЗароса); КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Список 	= Новый СписокЗначений;
	
	Пока Выборка.Следующий() Цикл
		Список.Добавить(Выборка.Заказ, СтрШаблон("%3: %1 %2 (%4) %5", 
					?(Выборка.ТипЗаказа = Тип("ДокументСсылка.ВнутреннийЗаказ"), "Внутренний заказ", ?(Выборка.ТипЗаказа = Тип("ДокументСсылка.ИнтернетЗаказПокупателя"), "Интернет заказ", "Заказ")),
					Выборка.Номер,
					Формат(Выборка.Дата, "ДФ=yyyy-MM-dd"),
					Выборка.Заказчик,
					Выборка.Сумма)); КонецЦикла;
					
	Возврат Список;
	
КонецФункции

Процедура ОбновитьТаблицуТоваров(ТаблицаТоваров, МассивЗаказов) Экспорт

	ТаблицаТоваров.Загрузить(Заказы.ПолучитьСостояниеТоваров(МассивЗаказов));
		
КонецПроцедуры
